{
  "title": "Headphone and Phone Stand, WixGear Premium Headphone and Phone Stand for iPhones, Android Smartphones & Mini Tablets –Sturdy Metal Phone Stand",
  "description": "WixGear Premium Headphone and Phone Stand for iPhones, Android Smartphones & Mini Tablets –Sturdy Metal Phone Stand\n\n\nFinally, you can use your phone and not keeping it in your hand for too long by using this cellphone stand, not only that it holds your phone, it can hold your headphones too. Charge and play with this simple yet very handy phone stand with headphone holder and experience a clutter-free desk.\n\n\n\n\n\nTOP REASONS WHY YOU SHOULD HAVE THIS WIXGEAR HEADPHONE AND PHONE STAND:\n\n✔ It can be used anywhere\n\nYou can bring this headphone stand for desk anywhere, in the office when working, in the kitchen when cooking and in your desktop when watching video.\n\n\n✔ It fits most cell phone and headphone models\n\nThis headphone stand for desk can hold 4-12 inches phones or mini tablets, it can hold most headphones too!\n\n\n✔ It saves your desktop space\n\nThis headphones stand for desk would hold both your cellphone and your headphone securely and clutter-free. No need to keep two stands, you can have it in one stand.\n\n\n✔ It is very stable and secured\n\nThis headphone stand holder phone stand desktop is made of a metal plate with a weighted base so it can hold more than 4.5 pounds devices very securely and no falling off.\n\n✔ It organizes your charging cables\n\nThis headphones stand holder mobile phone desk is designed with cable organizers to keep your desktop clutter-free and with reserved charging slot to keep your phone ready to charge anytime while your playing, watching videos or doing a video call.\n\n\n\n\nExperience a clutter-free desktop with this new WixGear Premium Headphone and Phone Stand for iPhones, Android Smartphones & Mini Tablets –Sturdy Metal Phone Stand. Add this to your cart now!",
  "url": "https://www.amazon.com/dp/B093TJ2YSZ",
  "keyword": "phone",
  "sellerName": "WizGear Direct",
  "price": "$17.99",
  "shippingPrice": "$11.60"
}